In [1]:
import pandas as pd
import numpy as np
#1st question
df = pd.DataFrame(
    {
        "customer_id": ["A", "B", "C", 'A'],
        "date": ["5/1/2017", "5/8/2017", "5/11/2017","5/1/2017"],
        "spend": [10, 5, 20,10]
    },
    #index = [1, 2, 3],
    columns = ["customer_id", "date", "spend"]
)
print df

  customer_id       date  spend
0           A   5/1/2017     10
1           B   5/8/2017      5
2           C  5/11/2017     20
3           A   5/1/2017     10

In [2]:
df.drop_duplicates(['customer_id'])

  customer_id       date  spend
0           A   5/1/2017     10
1           B   5/8/2017      5
2           C  5/11/2017     20

In [3]:
df.drop_duplicates(['date'])

  customer_id       date  spend
0           A   5/1/2017     10
1           B   5/8/2017      5
2           C  5/11/2017     20

Q2 
SQL:
SELECT request_id, COUNT (R.acceptance_id)  / (CAST COUNT (F. sent_to_id) AS DOUBLE PRECISON )AS acceptance_rate

FROM (

SELECT request_id, sent_to_id FROM friend_request) AS F

INNER JOIN 

(SELECT request_id, acceptance_id FROM request_acceptance) AS R

ON F.request_id= R.request_id 

GROUP BY request_id

In [6]:
Q3 #python
df_accept = df_fr.merge(df_ra,how='inner',left_on='requestor_id',right_on='requester_id')
df_accept = df_accept[df_accept.sent_to_id==df_accept.acceptor_id]
acceptance_rate = df_accept.shape[0]/df_fr.shape[0]

NameError: name 'Q3' is not defined

In [7]:
c_n=["4175004175004172", "4917491749174917","346416800707698","376416800707698","37641680070769832112","36641680070769","54545641680070769"]
l = ['4026', '4405', '4508', '4844','4913', '4917'] 

def credit_issuer(c_n):
    if len(c_n)==16 and c_n[0]=='4':
        if (c_n[0:4] in l) or (c_n[0:6]=='417500'):
            return 'VISAELECTRON'
        else:
            return 'VISA'
    elif len(c_n)==15 and (c_n[0:2]=='34' or c_n[0:2]=='37'):
        return 'AMEX'
    elif len(c_n)==14 and c_n[0:2]=='36':
        return 'Diners Club'
    else:
        return 'N/A'
    
for c_n in c_n:
    print c_n,credit_issuer(c_n)

4175004175004172 VISAELECTRON
4917491749174917 VISAELECTRON
346416800707698 AMEX
376416800707698 AMEX
37641680070769832112 N/A
36641680070769 Diners Club
54545641680070769 N/A

In [15]:
# Q4
file_location = "/Users/xingyuanwang/Downloads/"
file_name = "BA501_python_data.csv"
my_data = pd.read_csv(file_location+file_name, error_bad_lines=False)
my_data.head(5)

,country,date,experiment_id,order_id,spend_usd,user_id,vertical
0,JP,20170402,12624548,5813140433216629693,16.138855,5006730028073359543,ANDROID_APPS
1,US,20170403,12624549,16333056276711034931,9.990000,5938685669571545259,ANDROID_APPS
2,JP,20170404,12624548,11227119161741298366,19.887087,17623708458399141713,ANDROID_APPS
3,US,20170403,12624548,11927299833124210932,19.990000,18042812344456618148,ANDROID_APPS
4,JP,20170403,12624549,11644727017708872749,88.220093,4325104700699531031,ANDROID_APPS

In [16]:
%matplotlib inline
import matplotlib.pyplot as plt

In [17]:
import datetime

In [22]:
my_data.date = pd.to_datetime(my_data.date, format='%Y%m%d')